Cookbook.org
#+TITLE: Cookbook
#+AUTHOR: Jachin Minyard
:PROPERTIES:
#+LATEX_CLASS: article
#+STARTUP: overview
#+OPTIONS: toc:nil
#+OPTIONS: todo:nil
#+OPTIONS: H:6
#+OPTIONS: num:2
#+LATEX_HEADER: \usepackage[margin=.75in]{geometry}
#+LATEX_HEADER_EXTRA: \usepackage{graphicx}
:END:

Each recipe by default makes what I would call 1 serving with one serving being enough for a family of 4 most of the time.
* TODO Breads
** TODO Monkey Bread
** DONE Pumpkin Bread
*** Ingredients
- 3 Cups of sugar
- 1 cup salad oil
- 4 eggs beaten
- 1 can Del Monte Pumpkin || 1 3/4 cups of Pumpkin puree
- 3 1/2 Cups of flour
- 2 tsp of baking soda
- 2 tsp salt
- 1 tsp baking powder
- 1 tsp nutmeg
- 1 tsp all spice
- 1 tsp cinnamon
- 1/2 tsp cloves
- 2/3 cups of water
  
*** Instructions
- Cream the sugar and oil together.
- Add eggs and pumpkin, mix well
- Shift Dry ingredients together
- Add dry ingredients and water, alternating back and forth to avoid clumps.
- Poor into 2 well greased floured 9x5 inch loaf pans
- Bake at 350 \degree for 1 1/2 hrs or until done (check by poking with a tooth pick)
- Let stand for 10 minutes
- remove from pans to cool.
  
** TODO Banana Bread
** DONE Homemade Pie Crust

*** Ingredients
For a crust without a crust cover use the single crust ingredients if making a crust with a top use the Double Crust
**** Singe crust
- 1 3/4 cups of sifted all-purpose flour
- 1/2 tsp salt
- 2/3 cup of shortening
- 4-5 Tbsp of cold water
**** Double crust
- 2 1/2 cups of sifted all-purpose flour
- 1 tsp salt
- 1 cup of shortening
- 6 Tbsp of cold water
  
*** Instructions
- Sift the flower into a bowl and salt
- Add half the shortening and mix
- Add the rest of the shortening and finish mixing
- add a little of the cold water at a time kind of poking with a fork
- keep adding cold water till the dough is kinda flaky
  
The Key to making a crust is to not make an actual dough the crust needs to remain flaky.
This does make the crust harder to work with. but makes a better crust.
** DONE Cornbread
*** Ingredients
- 1 cup cornmeal
- 1 cup flour
- 1 Tbsp baking powder
- 1 tsp salt
- 1 egg
- 1 cup milk
- 1/3 cup butter
*** Instructions
Heat oven to 400F with a cast iron skillet in it.
Add the butter to the skillet and let it melt.

While it's melting, mix together the dry ingredients.

Beat egg and milk together.

After the butter is melted, add the egg and milk to the dry
ingredient, then add the melted butter.  Mix, but leave a
little lumpy.

Pour mix into the cast iron skillet and cook for 30 minutes.
* Deserts
** TODO Apple Pie
*** Ingredients
- 6->8 apples
- 3 Tbsp of flour
- 1/2 cup of sugar
- 1 Tbsp of cinnamon 
*** Instruction
- 
- 
-
  
* DONE Ethiopian 
** DONE Misir Wot
*** Ingredients
- 4 tbsp Spoons of Niter Kibbeh
- 1 Large Yellow Onion, Diced 
- 3 cloves of garlic, Minced 
- 1 Roma Tomato, Finely Chopped
- 3 tbsp of Tomato Paste
- 2 tbsp Spoons of Berbere
- 1 Cup of Red Lentils
- 2 1/2 Cups of Broth (chicken or vegetable)
- 1 tsp of salt
*** Instructions
1. Melt 3 tbsp of Niter Kibbeh in a large pot over medium heat.
2. Add onions and cook for around 8-10 mins or until golden brown
3. Add garlic, tomatoes, tomato paste, and 1 tbsp of Berbere. Cook for 5-8 mins or until the tomatoes have cooked down a bit.
4. Add Lentils and broth. Bring to a boil and then reduce to a simmer. Cook for 30-40 mins or until the lentils are soft. (stir occasionally)
5. Stir in the rest of the niter kibbeh and berbere. Add salt to taste.
** DONE Shiro Powder
*** Ingredients
- 3/4 Cup of Chickpea Flour
- 1 tbsp berbere
- 1 tsp ground cardamom
- 1 tsp cumin powder
- 1 tsp garlic powder
- 1tsp salt
*** Instructions
1. on skillet dry roast the ingredients
   
** DONE Shiro Wot
*** Ingredients
- 1 cup Shiro Powder
- 3 tbsp of Niter Kibbeh
- 1 large onion, diced 
- 1 tsp of garlic, minced
- 2 roma tomatoes, finely chopped
*** Instructions
1. Add the Niter Kibbeh to a pot and melt over medium heat.
2. Add the onions and cook for 8-10 mins till caramelized. 
3. Add the tomatoes and garlic. Cook till reduced stirring occasionally. 
4. Add the Shiro Powder and stir till there are no more dry lumps.
5. Add 2 cups of water and bring to a boil. Reduce to a simmer and cook for 20-30 mins.
   
** DONE Tikil Gomen
*** Ingredients
- 1 Cabbage diced
- 1 Yellow Onion sliced long ways
- 4 Large Carrots sliced in to slivers
- 4 Green Chilies chopped
- 4 Cloves of Garlic minced 
- 2 Spoons of Turmeric
- 1 Spoon of Bebere
- 3 tbsp of Niter Kiber
*** Instructions
1. Add Niter Kiber to a pan, melt over medium heat.
2. Add onions and cook till clear
3. Add Carrots, garlic, and peppers cook till carrots start to soften. 
4. Add bebere and turmeric mix well.
5. Add the cabage and cover. cook for 10 mins stirring occasionally
   
** DONE Ye'abasha Gomen
*** Ingredients
- 10 ounces of collard greens, chopped
- 3 tbsp of Niter Kibbeh
- 1 1/2 tsp of ginger, minced
- 2 tsp of garlic, minced
- 1 large white onion diced
- 1 tsp of smoked paprika
- 1/2 tsp of cardamon 
- 1 tsp of coriander/cumin
- 1-2 fresh chili peppers, minced
- 2 tbsp of lemon juice
*** Instructions
1. Add Niter Kibbeh, garlic, ginger, peppers, and other dried spices to a large skillet and saute for 30 sec. Don't burn them! 
2. Add the onions and mix well. Saute for another 5 min.
3. Toss in the collared greens and lemon juice. Turn down heat and cook till collared greens are wilted. 

** DONE Fasollia
*** Ingredients
- 1lb of green beans, chopped (remove the ends) 
- 1lb of carrots, julienned (cut longways into strips) 
- 1 medium onion, diced
- 1 tbsp of garlic, minced
- 1 tsp of ginger, grated
- 2 tbsp of Niter Kibbeh
- salt as needed
- 1/4 cup of water (more as needed).
*** Instructions
1. Add the green beans to a pan and cook till they start to brown and reduce. add a little salt, The idea is to dry them out as much as possible.
2. Take the green beans out and set aside.
3. Add the niter kibbeh to the pan and add onions. Cook for about 5 mins.
4. Add the garlic and ginger. Cook for another 2 mins
5. Add the carrots and water and simmer for about 10 mins. Stir occasionally, add more water as needed.
6. Add the green beans back and simmer over medium heat for another 10 mins.
    
** DONE Niter Kibbeh
