Cookbook.tex
% Created 2025-10-02 Thu 22:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=.75in]{geometry}
\usepackage{graphicx}
\setcounter{secnumdepth}{2}
\author{Jachin Minyard}
\date{\today}
\title{Cookbook}
\hypersetup{
 pdfauthor={Jachin Minyard},
 pdftitle={Cookbook},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle

Each recipe by default makes what I would call 1 serving with one serving being enough for a family of 4 most of the time.
\section{Breads}
\label{sec:orge0b84ce}
\subsection{Monkey Bread}
\label{sec:org88ae27b}
\subsection{Pumpkin Bread}
\label{sec:org595860b}
\subsubsection*{Ingredients}
\label{sec:org4393a90}
\begin{itemize}
\item 3 Cups of sugar
\item 1 cup salad oil
\item 4 eggs beaten
\item 1 can Del Monte Pumpkin || 1 3/4 cups of Pumpkin puree
\item 3 1/2 Cups of flour
\item 2 tsp of baking soda
\item 2 tsp salt
\item 1 tsp baking powder
\item 1 tsp nutmeg
\item 1 tsp all spice
\item 1 tsp cinnamon
\item 1/2 tsp cloves
\item 2/3 cups of water
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orge15bd29}
\begin{itemize}
\item Cream the sugar and oil together.
\item Add eggs and pumpkin, mix well
\item Shift Dry ingredients together
\item Add dry ingredients and water, alternating back and forth to avoid clumps.
\item Poor into 2 well greased floured 9x5 inch loaf pans
\item Bake at 350 \degree for 1 1/2 hrs or until done (check by poking with a tooth pick)
\item Let stand for 10 minutes
\item remove from pans to cool.
\end{itemize}
\subsection{Banana Bread}
\label{sec:org41e3030}
\subsection{Homemade Pie Crust}
\label{sec:orgc162976}

\subsubsection*{Ingredients}
\label{sec:orgd8e5269}
For a crust without a crust cover use the single crust ingredients if making a crust with a top use the Double Crust
\paragraph*{Singe crust}
\label{sec:orgfd0759e}
\begin{itemize}
\item 1 3/4 cups of sifted all-purpose flour
\item 1/2 tsp salt
\item 2/3 cup of shortening
\item 4-5 Tbsp of cold water
\end{itemize}
\paragraph*{Double crust}
\label{sec:org30412db}
\begin{itemize}
\item 2 1/2 cups of sifted all-purpose flour
\item 1 tsp salt
\item 1 cup of shortening
\item 6 Tbsp of cold water
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org31aa248}
\begin{itemize}
\item Sift the flower into a bowl and salt
\item Add half the shortening and mix
\item Add the rest of the shortening and finish mixing
\item add a little of the cold water at a time kind of poking with a fork
\item keep adding cold water till the dough is kinda flaky
\end{itemize}

The Key to making a crust is to not make an actual dough the crust needs to remain flaky.
This does make the crust harder to work with. but makes a better crust.
\subsection{Cornbread}
\label{sec:org28ea235}
\subsubsection*{Ingredients}
\label{sec:org5ee152d}
\begin{itemize}
\item 1 cup cornmeal
\item 1 cup flour
\item 1 Tbsp baking powder
\item 1 tsp salt
\item 1 egg
\item 1 cup milk
\item 1/3 cup butter
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org7eaa17e}
Heat oven to 400F with a cast iron skillet in it.
Add the butter to the skillet and let it melt.

While it's melting, mix together the dry ingredients.

Beat egg and milk together.

After the butter is melted, add the egg and milk to the dry
ingredient, then add the melted butter.  Mix, but leave a
little lumpy.

Pour mix into the cast iron skillet and cook for 30 minutes.
\section{Deserts}
\label{sec:org84730f5}
\subsection{Apple Pie}
\label{sec:org75f84e5}
\subsubsection*{Ingredients}
\label{sec:orgdd2d681}
\begin{itemize}
\item 6->8 apples
\item 3 Tbsp of flour
\item 1/2 cup of sugar
\item 1 Tbsp of cinnamon
\end{itemize}
\subsubsection*{Instruction}
\label{sec:org5ecad7e}
\begin{itemize}
\item 

\item 

\item 
\end{itemize}
\section{Ethiopian}
\label{sec:org3c286b1}
\subsection{Misir Wot}
\label{sec:orgb337cea}
\subsubsection*{Ingredients}
\label{sec:orgb07ec42}
\begin{itemize}
\item 4 tbsp Spoons of Niter Kibbeh
\item 1 Large Yellow Onion, Diced
\item 3 cloves of garlic, Minced
\item 1 Roma Tomato, Finely Chopped
\item 3 tbsp of Tomato Paste
\item 2 tbsp Spoons of Berbere
\item 1 Cup of Red Lentils
\item 2 1/2 Cups of Broth (chicken or vegetable)
\item 1 tsp of salt
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org80d838b}
\begin{enumerate}
\item Melt 3 tbsp of Niter Kibbeh in a large pot over medium heat.
\item Add onions and cook for around 8-10 mins or until golden brown
\item Add garlic, tomatoes, tomato paste, and 1 tbsp of Berbere. Cook for 5-8 mins or until the tomatoes have cooked down a bit.
\item Add Lentils and broth. Bring to a boil and then reduce to a simmer. Cook for 30-40 mins or until the lentils are soft. (stir occasionally)
\item Stir in the rest of the niter kibbeh and berbere. Add salt to taste.
\end{enumerate}
\subsection{Shiro Powder}
\label{sec:org8bec789}
\subsubsection*{Ingredients}
\label{sec:orgbbda045}
\begin{itemize}
\item 3/4 Cup of Chickpea Flour
\item 1 tbsp berbere
\item 1 tsp ground cardamom
\item 1 tsp cumin powder
\item 1 tsp garlic powder
\item 1tsp salt
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org31d6dba}
\begin{enumerate}
\item on skillet dry roast the ingredients
\end{enumerate}
\subsection{Shiro Wot}
\label{sec:org1073b94}
\subsubsection*{Ingredients}
\label{sec:orge7b6309}
\begin{itemize}
\item 1 cup Shiro Powder
\item 3 tbsp of Niter Kibbeh
\item 1 large onion, diced
\item 1 tsp of garlic, minced
\item 2 roma tomatoes, finely chopped
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgd2330a5}
\begin{enumerate}
\item Add the Niter Kibbeh to a pot and melt over medium heat.
\item Add the onions and cook for 8-10 mins till caramelized.
\item Add the tomatoes and garlic. Cook till reduced stirring occasionally.
\item Add the Shiro Powder and stir till there are no more dry lumps.
\item Add 2 cups of water and bring to a boil. Reduce to a simmer and cook for 20-30 mins.
\end{enumerate}
\subsection{Tikil Gomen}
\label{sec:orgda4bff4}
\subsubsection*{Ingredients}
\label{sec:org6ad4fcb}
\begin{itemize}
\item 1 Cabbage diced
\item 1 Yellow Onion sliced long ways
\item 4 Large Carrots sliced in to slivers
\item 4 Green Chilies chopped
\item 4 Cloves of Garlic minced
\item 2 Spoons of Turmeric
\item 1 Spoon of Bebere
\item 3 tbsp of Niter Kiber
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgf2a19a6}
\begin{enumerate}
\item Add Niter Kiber to a pan, melt over medium heat.
\item Add onions and cook till clear
\item Add Carrots, garlic, and peppers cook till carrots start to soften.
\item Add bebere and turmeric mix well.
\item Add the cabage and cover. cook for 10 mins stirring occasionally
\end{enumerate}
\subsection{Ye'abasha Gomen}
\label{sec:org5fde9ca}
\subsubsection*{Ingredients}
\label{sec:orgd0bea21}
\begin{itemize}
\item 10 ounces of collard greens, chopped
\item 3 tbsp of Niter Kibbeh
\item 1 1/2 tsp of ginger, minced
\item 2 tsp of garlic, minced
\item 1 large white onion diced
\item 1 tsp of smoked paprika
\item 1/2 tsp of cardamon
\item 1 tsp of coriander/cumin
\item 1-2 fresh chili peppers, minced
\item 2 tbsp of lemon juice
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org00f8f97}
\begin{enumerate}
\item Add Niter Kibbeh, garlic, ginger, peppers, and other dried spices to a large skillet and saute for 30 sec. Don't burn them!
\item Add the onions and mix well. Saute for another 5 min.
\item Toss in the collared greens and lemon juice. Turn down heat and cook till collared greens are wilted.
\end{enumerate}
\subsection{Fasollia}
\label{sec:org54c3253}
\subsubsection*{Ingredients}
\label{sec:org09ddcb2}
\begin{itemize}
\item 1lb of green beans, chopped (remove the ends)
\item 1lb of carrots, julienned (cut longways into strips)
\item 1 medium onion, diced
\item 1 tbsp of garlic, minced
\item 1 tsp of ginger, grated
\item 2 tbsp of Niter Kibbeh
\item salt as needed
\item 1/4 cup of water (more as needed).
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org27573b7}
\begin{enumerate}
\item Add the green beans to a pan and cook till they start to brown and reduce. add a little salt, The idea is to dry them out as much as possible.
\item Take the green beans out and set aside.
\item Add the niter kibbeh to the pan and add onions. Cook for about 5 mins.
\item Add the garlic and ginger. Cook for another 2 mins
\item Add the carrots and water and simmer for about 10 mins. Stir occasionally, add more water as needed.
\item Add the green beans back and simmer over medium heat for another 10 mins.
\end{enumerate}
