Cookbook.org
*** Ingredients
- 1 lb unsalted butter
- 1/4 yellow onion, minced
- 3 tbsp of garlic, minced
- 2 tbsp of ginger, minced
- 1 2in cinnamon stick
- 1 tsp black peppercorn, whole
- 3 black cardamom pods, whole
- 1 tsp fenugreek seeds
- 1 tsp coriander seeds
- 1 tsp dried oregano
- 1/2 tsp cumin seeds
- 1/4 tsp ground nutmeg
- 1/4 tsp ground turmeric
- 1 tbsp of Beso Bila (Ethiopian basil)
- 1 tbsp of Kosseret (Ethiopian herb)
*** Instructions
1. place dry herbs on a skillet and roast till fragment. Careful not to scorch the spices. 
2. Place all ingredients in a saucepan bring to a low simmer and cook for 60-90 mins. Careful not to burn the butter or it will become bitter. 
3. Pour through cheese cloth to strain out all the herbs and spices. Place in an airtight jar and store it.
* TODO Indian
** DONE Masala paste
*** Ingredients
- 1 cup coconut, grated
- 8 cashews
- 1 in or ginger 
- 1 clove of garlic
- 2 green chili's
- 2 tbsp poppy seeds
- 1 tsp coriander seeds
- 1/2 tsp fennel
- handful of coriander
- 1/4 cup of water
*** Instructions
1. put ingredients and water in a food processor and blend till smooth. add water as needed.
** TODO Veggie Korma
*** Ingredients
- 4 tsp of olive oil
- 1 bay leaf
- 1 2in cinnamon stick
- 2 pod of cardamon or 1/2 tsp of cardamon seeds
- 3 cloves
- 1 yellow onion, finely chopped
- 1 roma tomato, finely chopped
- 1 carrot, chopped or handful of baby carrots, chopped
-
  
*** Instructions
1. 
2. 
3. 
4. 
5. 
6. 
7.
   
** DONE Paruppu Sadham
This is a classic rice and dal dish from Coimbatore. For a 2.0 ltr pressure cooker half the recipe.
*** Ingredients
- 1 cup of rice. 
- 1/4 cup of Toor dal
- 2 tbsp of cooking oil
- 2 tbsp of Ghee
- 1/2 tsp Dried Mustard
- 1 tsp cumin
- 6 - 8 Curry Leaves
- 1 tsp Black pepper corns (whole)
- 5 cloves of garlic (whole)
- 1 - 2 Green Chilies
- 1 - 2 Dried Red Chilies
- 1/2 tsp hing
- 1 small red onion
- 2 Roma Tomato
- 1/4 tsp turmeric powder
- 1/2 tsp chili powder
- hand full of fresh coriander
- 3 cups of water
- salt to taste.
*** Instructions
1. Add the dal and rice to a bowl. Rinse until the water is clear and all the dirt has been removed.
2. After rinsing the rice and dal add just enough water to let it soak for 30min. (fill till water is just above the top of the rice)
3. Add oil and Ghee to the pressure cooker, followed by the mustard, cumin, black pepper, garlic cloves, and chilies. Saute for 1 min.
4. Add the Hing and onions and curry leaves. Saute for another min.
5. Add the Tomato's, Turmeric, and chili powder, and salt to taste. Cook till the tomato's become soft.
6. Add the soaked dal, rice, and water.
7. Cover with pressure cooker lid and cook for 3 Whistles.
8. Take off heat let pressure vent.
9. Remove lid add coriander and mix well.
** WAITING Andhra Chicken Curry
*** Ingredients
- 2 tbsp Oil
- 1 red onion
- 3 curry peppers
- 1 Roma Tomato
- 6 chicken tenderloins
- 1 tbsp Ginger Garlic paste
- 1 cup of water
- 4 tsp of salt
- chili powder
- turmeric
- cumin
- coriander
- Gram Masala
- Chicken Masala
*** Instructions
1. Add oil to a pressure pot
2. Add the onion and a little bit of salt.
3. Add the curry Peppers
4. Add the Ginger Garlic Paste and mix well.
5. Add Chopped Chicken to the pot. add another 2tsp of salt
6. Add Spices.
7. Add tomato and mix
8. Bring to boil and then pressurize. Cook for 10  mins, or till chicken is cooked.

** DONE Bhindi Fry
*** Ingredients
1. 1lb of Bhindi.
2. 1/4 cup of gram flour
3. 1/4 cup of rice flour
4. 1 Tbsp of corn flour
5. 1/4 Tsp of turmeric powder
6. 2 Tsp of Chili powder
7. 1 Tsp of Coriander powder
8. 1 Tsp of Cumin powder
9. 1 Tsp of salt
10. Canola Oil (Frying)
11. Olive oil (Roasting)
12. Cashews
13. 4-6 Green Chili's
14. Curry Leaves
15. Peanuts (optional)
   
*** Instructions
1. Mix the Flour's and Spices together in a bowl make sure you mix it well.
   1. 1/4 cup of gram flour
   2. 1/4 cup of rice flour
   3. 1 Tbsp of corn flour
   4. 1/4 Tsp of turmeric powder
   5. 2 Tsp of Chili powder
   6. 1 Tsp of Coriander powder
   7. 1 Tsp of Cumin powder
   8. 1 Tsp of salt
2. Wash Dry and chop up the Bhindi in to pieces.
3. Mix the flour and spices with the Bhindi pieces.
4. Sprinkle on a little water to help it bind, let sit for 3-5min.
5. Add fry oil to large pan(don't fill the pan shallow fry)
6. add Bhindi cook and set aside
7. Roast:
   1. Roast the curry leaves, set aside
   2. Roast the cashews till golden brown, set aside
   3. Roast Peanuts, set asside
   4. Slit and roast the peppers, set aside
8. Add the roasted ingredients to the fried Bhindi and mix well.

** TODO Sambar Masala
*** Ingredients
*** Instructions
** TODO Sambar
*** Ingredients
*** Instructions
** Rasam Rice
*** Ingredients
- 1 Cup of Rice
- 1/2 cup of Dal (any kind)
- 1 spoon tamarind Paste (soaked)
- 1 Tomato
- 3-4 large spoons Rasam Powder
- 1/4 tsp Turmeric 
- Salt to taste
- 2 tbsp of oil
- 2 tbsp of ghee
- 5-7 curry leaves
- 2 garlic cloves
- 1 tbsp Jeera(ish) (cumin seeds)
- 1/2 tbsp(ish) mustard seeds
- 6 cups of water
*** Instructions
1. Soak rice and dal for 30 min
2. Soak Tamarind paste for 10 mins (if paste, raw 30 mins)
3. in pan saute garlic and tomato's with 1 spoon of ghee and oil.
4. Add turmeric and rasam powder to pan mix well.
5. Add soaked rice and dal.
6. add 6 cups of water
7. Cover and cook for 5 whistles.
8. Take a new pot add ghee and oil
9. add cumin seed, mustard seeds and curry leaves. saute for 1 min.
10. mix ingredients from step 9 into the rice mix well, and eat.
   
** Potato Fry
*** Ingredients
- 6-7 Potatoes 
- oil
- 1/2 tbsp mustard's seeds
- 1tbsp  Jeera (cumin seeds)
- 1-2 tbsp chili powder
- salt to taste
- 1/2 tbsp coriander powder
*** Instructions
1. cut potatoes into small slices (teeny tiny)
2. add oil to a pan
3. add Jeera and mustard seeds, and potatoes saute .
4. add all the spices.
5. mix well until cooked (constantly)
6. Cover and cook for 2-3 mins
7. Serve and enjoy.
   
* TODO Thai
* TODO Mexican
* TODO Italian
** Fettuccine Alfredo
*** Ingredients
1. Fettuccine noodles
2. Butter
3. Grated Parmigiana cheese
4. Whipping cream
*** Instructions
1. Cook the Fettuccine per instructions.
2. Drain and return to pan on medium low heat.
3. Immediately add enough butter to coat the noodles and have some left over in the pan
   - but not swimming in the butter.
4. Add the parmigiana and let melt, stirring constantly to keep it from globbing up too much.
   - The cheese should coat the noodles well, but not excessively.
5. Add enough cream to reach an easily stirrable consistency.
   - Be careful to not add too much.
* TODO Spice Mixes
* TODO Hungarian
** TODO Hungarian Caramelized Cabbage and Noodles
