Cookbook.tex
\subsection{Niter Kibbeh}
\label{sec:orgf13258b}
\subsubsection*{Ingredients}
\label{sec:org9e2f206}
\begin{itemize}
\item 1 lb unsalted butter
\item 1/4 yellow onion, minced
\item 3 tbsp of garlic, minced
\item 2 tbsp of ginger, minced
\item 1 2in cinnamon stick
\item 1 tsp black peppercorn, whole
\item 3 black cardamom pods, whole
\item 1 tsp fenugreek seeds
\item 1 tsp coriander seeds
\item 1 tsp dried oregano
\item 1/2 tsp cumin seeds
\item 1/4 tsp ground nutmeg
\item 1/4 tsp ground turmeric
\item 1 tbsp of Beso Bila (Ethiopian basil)
\item 1 tbsp of Kosseret (Ethiopian herb)
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orga92eae9}
\begin{enumerate}
\item place dry herbs on a skillet and roast till fragment. Careful not to scorch the spices.
\item Place all ingredients in a saucepan bring to a low simmer and cook for 60-90 mins. Careful not to burn the butter or it will become bitter.
\item Pour through cheese cloth to strain out all the herbs and spices. Place in an airtight jar and store it.
\end{enumerate}
\section{Indian}
\label{sec:orge8a99f9}
\subsection{Masala paste}
\label{sec:orgff68bcf}
\subsubsection*{Ingredients}
\label{sec:orgad35ba7}
\begin{itemize}
\item 1 cup coconut, grated
\item 8 cashews
\item 1 in or ginger
\item 1 clove of garlic
\item 2 green chili's
\item 2 tbsp poppy seeds
\item 1 tsp coriander seeds
\item 1/2 tsp fennel
\item handful of coriander
\item 1/4 cup of water
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org9c7286b}
\begin{enumerate}
\item put ingredients and water in a food processor and blend till smooth. add water as needed.
\end{enumerate}
\subsection{Veggie Korma}
\label{sec:orge480101}
\subsubsection*{Ingredients}
\label{sec:org9c32ebe}
\begin{itemize}
\item 4 tsp of olive oil
\item 1 bay leaf
\item 1 2in cinnamon stick
\item 2 pod of cardamon or 1/2 tsp of cardamon seeds
\item 3 cloves
\item 1 yellow onion, finely chopped
\item 1 roma tomato, finely chopped
\item 1 carrot, chopped or handful of baby carrots, chopped
\item 
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org06100da}
\begin{enumerate}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}
\subsection{Paruppu Sadham}
\label{sec:orge802edb}
This is a classic rice and dal dish from Coimbatore. For a 2.0 ltr pressure cooker half the recipe.
\subsubsection*{Ingredients}
\label{sec:org0a61bae}
\begin{itemize}
\item 1 cup of rice.
\item 1/4 cup of Toor dal
\item 2 tbsp of cooking oil
\item 2 tbsp of Ghee
\item 1/2 tsp Dried Mustard
\item 1 tsp cumin
\item 6 - 8 Curry Leaves
\item 1 tsp Black pepper corns (whole)
\item 5 cloves of garlic (whole)
\item 1 - 2 Green Chilies
\item 1 - 2 Dried Red Chilies
\item 1/2 tsp hing
\item 1 small red onion
\item 2 Roma Tomato
\item 1/4 tsp turmeric powder
\item 1/2 tsp chili powder
\item hand full of fresh coriander
\item 3 cups of water
\item salt to taste.
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org9114f9e}
\begin{enumerate}
\item Add the dal and rice to a bowl. Rinse until the water is clear and all the dirt has been removed.
\item After rinsing the rice and dal add just enough water to let it soak for 30min. (fill till water is just above the top of the rice)
\item Add oil and Ghee to the pressure cooker, followed by the mustard, cumin, black pepper, garlic cloves, and chilies. Saute for 1 min.
\item Add the Hing and onions and curry leaves. Saute for another min.
\item Add the Tomato's, Turmeric, and chili powder, and salt to taste. Cook till the tomato's become soft.
\item Add the soaked dal, rice, and water.
\item Cover with pressure cooker lid and cook for 3 Whistles.
\item Take off heat let pressure vent.
\item Remove lid add coriander and mix well.
\end{enumerate}
\subsection{WAITING Andhra Chicken Curry}
\label{sec:org734383f}
\subsubsection*{Ingredients}
\label{sec:org04cb3b4}
\begin{itemize}
\item 2 tbsp Oil
\item 1 red onion
\item 3 curry peppers
\item 1 Roma Tomato
\item 6 chicken tenderloins
\item 1 tbsp Ginger Garlic paste
\item 1 cup of water
\item 4 tsp of salt
\item chili powder
\item turmeric
\item cumin
\item coriander
\item Gram Masala
\item Chicken Masala
\end{itemize}
\subsubsection*{Instructions}
\label{sec:org2003311}
\begin{enumerate}
\item Add oil to a pressure pot
\item Add the onion and a little bit of salt.
\item Add the curry Peppers
\item Add the Ginger Garlic Paste and mix well.
\item Add Chopped Chicken to the pot. add another 2tsp of salt
\item Add Spices.
\item Add tomato and mix
\item Bring to boil and then pressurize. Cook for 10  mins, or till chicken is cooked.
\end{enumerate}
\subsection{Bhindi Fry}
\label{sec:orga5b9a77}
\subsubsection*{Ingredients}
\label{sec:org70bf5d2}
\begin{enumerate}
\item 1lb of Bhindi.
\item 1/4 cup of gram flour
\item 1/4 cup of rice flour
\item 1 Tbsp of corn flour
\item 1/4 Tsp of turmeric powder
\item 2 Tsp of Chili powder
\item 1 Tsp of Coriander powder
\item 1 Tsp of Cumin powder
\item 1 Tsp of salt
\item Canola Oil (Frying)
\item Olive oil (Roasting)
\item Cashews
\item 4-6 Green Chili's
\item Curry Leaves
\item Peanuts (optional)
\end{enumerate}
\subsubsection*{Instructions}
\label{sec:orgee8bccc}
\begin{enumerate}
\item Mix the Flour's and Spices together in a bowl make sure you mix it well.
\begin{enumerate}
\item 1/4 cup of gram flour
\item 1/4 cup of rice flour
\item 1 Tbsp of corn flour
\item 1/4 Tsp of turmeric powder
\item 2 Tsp of Chili powder
\item 1 Tsp of Coriander powder
\item 1 Tsp of Cumin powder
\item 1 Tsp of salt
\end{enumerate}
\item Wash Dry and chop up the Bhindi in to pieces.
\item Mix the flour and spices with the Bhindi pieces.
\item Sprinkle on a little water to help it bind, let sit for 3-5min.
\item Add fry oil to large pan(don't fill the pan shallow fry)
\item add Bhindi cook and set aside
\item Roast:
\begin{enumerate}
\item Roast the curry leaves, set aside
\item Roast the cashews till golden brown, set aside
\item Roast Peanuts, set asside
\item Slit and roast the peppers, set aside
\end{enumerate}
\item Add the roasted ingredients to the fried Bhindi and mix well.
\end{enumerate}
\subsection{Sambar Masala}
\label{sec:org8c0708f}
\subsubsection*{Ingredients}
\label{sec:org70cdda7}
\subsubsection*{Instructions}
\label{sec:org54273d9}
\subsection{Sambar}
\label{sec:org16a2e55}
\subsubsection*{Ingredients}
\label{sec:org811e2ab}
\subsubsection*{Instructions}
\label{sec:org001bde5}
\subsection{Rasam Rice}
\label{sec:org2fa98c5}
\subsubsection*{Ingredients}
\label{sec:org357f93e}
\begin{itemize}
\item 1 Cup of Rice
\item 1/2 cup of Dal (any kind)
\item 1 spoon tamarind Paste (soaked)
\item 1 Tomato
\item 3-4 large spoons Rasam Powder
\item 1/4 tsp Turmeric
\item Salt to taste
\item 2 tbsp of oil
\item 2 tbsp of ghee
\item 5-7 curry leaves
\item 2 garlic cloves
\item 1 tbsp Jeera(ish) (cumin seeds)
\item 1/2 tbsp(ish) mustard seeds
\item 6 cups of water
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgc940c70}
\begin{enumerate}
\item Soak rice and dal for 30 min
\item Soak Tamarind paste for 10 mins (if paste, raw 30 mins)
\item in pan saute garlic and tomato's with 1 spoon of ghee and oil.
\item Add turmeric and rasam powder to pan mix well.
\item Add soaked rice and dal.
\item add 6 cups of water
\item Cover and cook for 5 whistles.
\item Take a new pot add ghee and oil
\item add cumin seed, mustard seeds and curry leaves. saute for 1 min.
\item mix ingredients from step 9 into the rice mix well, and eat.
\end{enumerate}
\subsection{Potato Fry}
\label{sec:org292a8c8}
\subsubsection*{Ingredients}
\label{sec:org0a4a1bd}
\begin{itemize}
\item 6-7 Potatoes
\item oil
\item 1/2 tbsp mustard's seeds
\item 1tbsp  Jeera (cumin seeds)
\item 1-2 tbsp chili powder
\item salt to taste
\item 1/2 tbsp coriander powder
\end{itemize}
\subsubsection*{Instructions}
\label{sec:orgb889671}
\begin{enumerate}
\item cut potatoes into small slices (teeny tiny)
\item add oil to a pan
\item add Jeera and mustard seeds, and potatoes saute .
\item add all the spices.
\item mix well until cooked (constantly)
\item Cover and cook for 2-3 mins
\item Serve and enjoy.
\end{enumerate}
\section{Thai}
\label{sec:org1e298d8}
\section{Mexican}
\label{sec:org994e298}
\section{Italian}
\label{sec:org1257e87}
\subsection{Fettuccine Alfredo}
\label{sec:org84fb14c}
\subsubsection*{Ingredients}
\label{sec:org3990cd0}
\begin{enumerate}
\item Fettuccine noodles
\item Butter
\item Grated Parmigiana cheese
\item Whipping cream
\end{enumerate}
\subsubsection*{Instructions}
\label{sec:org64cadca}
\begin{enumerate}
\item Cook the Fettuccine per instructions.
\item Drain and return to pan on medium low heat.
\item Immediately add enough butter to coat the noodles and have some left over in the pan
\begin{itemize}
\item but not swimming in the butter.
\end{itemize}
\item Add the parmigiana and let melt, stirring constantly to keep it from globbing up too much.
\begin{itemize}
\item The cheese should coat the noodles well, but not excessively.
\end{itemize}
\item Add enough cream to reach an easily stirrable consistency.
\begin{itemize}
\item Be careful to not add too much.
\end{itemize}
\end{enumerate}
\section{Spice Mixes}
\label{sec:org18dfd26}
\section{Hungarian}
\label{sec:orgd79d77d}
\subsection{Hungarian Caramelized Cabbage and Noodles}
\label{sec:orge31bad2}
