Cookbook.tex
\subsubsection*{Ingredients}
\label{sec:org9c2151f}
\begin{enumerate}
\item 2.5 lbs cabbage, finely shreaded (about 10 cups/2.5L, loosely packed)
\item 1 tsp salt
\item .5 cup olive oil
\item 1.5 tsp black pepper
\item 8 oz noodles
\end{enumerate}
\subsubsection*{Instructions}
\label{sec:org2f603c2}
\begin{enumerate}
\item In a large colander, mix cabbage and salt.  Set aside for 30 to 45
minutes.  Using your hands, squeeze excess liquid from cabbage and
transfer to a bowl.
\item In a large pot, over medium head, add oil to a hot pan.  Add
cabbage and stir to coat.  Cook, stirring occasionally, for about 5
minutes, until wilted.  Cover, reduce heat to low, and cook,
stirring occasionally, for about 1 hour, until tender and golden.
\item Increase heat to medium and cook, uncovered, stirring often and
scraping up browned bits from the bottom of the pan, for about 12
to 20 minutes, until cabbage is brown and very soft.
\item Stir in 1tsp pepper.
\item Meanwhile, cook noodles until tender but firm and drain.
\item Add noodles to cabbage and mix.  Add more pepper to taste.
\end{enumerate}
\end{document}
